In [1]:
import pandas as pd

In [2]:
people = {
    'First':['Keshav','Rahul','Rajesh'],
    'Last' :['Sharma','Sharma','Kushwaha'],
    'Email':['Kesh4118@gmail.com','Rahul81.rs@gmail.com','Kush@gmail.com']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    First      Last                 Email
0  Keshav    Sharma    Kesh4118@gmail.com
1   Rahul    Sharma  Rahul81.rs@gmail.com
2  Rajesh  Kushwaha        Kush@gmail.com

In [5]:
df.columns = ["First_name","Last_name","Email"]
# for all columns change if you miss one you got error

In [6]:
df

  First_name Last_name                 Email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [17]:
df.columns = [x.upper() for x in df.columns]

In [18]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [19]:
df.columns = [x.lower() for x in df.columns]

In [20]:
df

  first_name last_name                 email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [21]:
df.columns = df.columns.str.replace("_"," ")

In [22]:
df

  first name last name                 email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [25]:
df.columns = df.columns.str.replace(" ","_")

In [26]:
df

  first_name last_name                 email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [13]:
#  df.email = [Email]
# we can't Update particular columns like this,if we try we have to face error.

In [27]:
df.rename(columns={"first_name": "first","last_name":"last"},inplace=True)
#In raname mathod we prasent column name as key and updating column name as value in dicsionary
# inplace use for parmanent changes

In [28]:
df

    first      last                 email
0  Keshav    Sharma    Kesh4118@gmail.com
1   Rahul    Sharma  Rahul81.rs@gmail.com
2  Rajesh  Kushwaha        Kush@gmail.com

In [29]:
#  Rows Modification

In [38]:
df.loc[1]=["anchal","Dubay","anchu@gmail.com"]
# we changed a row

In [39]:
df

    first      last               email
0  Keshav    Sharma  Kesh4118@gmail.com
1  anchal     Dubay     anchu@gmail.com
2  Rajesh  Kushwaha      Kush@gmail.com

In [46]:
# now we will change a particular part
df.loc[1,['last','email']]=["ali",'Aali@gmail.com']

In [47]:
df

    first    last               email
0  Keshav  Sharma  Kesh4118@gmail.com
1  anchal     ali      Aali@gmail.com
2  Rajesh     das      Adas@gmail.com

In [54]:
# we can use .at function also insteat of uning .loc
df.at[1,['last','email']]=['das','Adas@gmail.com']

In [55]:
df

    first      last               email
0  Keshav    Sharma  Kesh4118@gmail.com
1  anchal       das      Adas@gmail.com
2  Rajesh  Kushwaha      kush@gmail.com